Revit 2027 API
BuiltInFailures.EditingFailures.InvalidArrayObject Property
 Some or all of the selected objects can't be created in an Array (for example, a Camera object for a 3D View).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidArrayObject { get; }
Public Shared ReadOnly Property InvalidArrayObject As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidArrayObject {
	FailureDefinitionId^ get ();
}
static member InvalidArrayObject : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace